

let dict = {
	//Եղիշե Չարենց
	'E.ch' : ["Ես իմ անուշ Հայաստանի"],
	
	//Պարույր Սևակ
	'P.sev' : ["Մարդ կա ելել է շալակն աշխարհի, Մարդ կա աշխարհն է շալակած տանում…", "Հայաստան"],
	
	//Հովհաննես Թումանյան
	'H.tum' : ["Հայոց լեռներում"],
	
	//Համո Սահյան
	'H.sah' : ["Հայաստան ասելիս"]
	};

let dict_poets ={
	
	//Եղիշե Չարենց
	'Ես իմ անուշ Հայաստանի' : "<h3>Ես իմ անուշ Հայաստանի</h3><br><br>Ես իմ անուշ Հայաստանի արևահամ բարն եմ սիրում,<br><br>Մեր հին սազի ողբանվագ, լացակումած լարն եմ սիրում,<br><br>Արնանման ծաղիկների ու վարդերի բույրը վառման,<br><br>Ու նաիրյան աղջիկների հեզաճկուն պա՛րն եմ սիրում։<br><br><br><br>Սիրում եմ մեր երկինքը մուգ, ջրերը ջինջ, լիճը լուսե,<br><br>Արևն ամռան ու ձմեռվա վիշապաձայն բուքը վսեմ,<br><br>Մթում կորած խրճիթների անհյուրընկալ պատերը սև,<br><br>Ու հնամյա քաղաքների հազարամյա քա՛րն եմ սիրում։<br><br><br><br>Ո՛ւր էլ լինեմ - չե՛մ մոռանա ես ողբաձայն երգերը մեր,<br><br>Չե՜մ մոռանա աղոթք դարձած երկաթագիր գրքերը մեր,<br><br>Ինչքան էլ սո՜ւր սիրտս խոցեն արյունաքամ վերքերը մեր<br><br> -Էլի՛ ես որբ ու արնավառ իմ Հայաստան - յա՛րն եմ սիրում։<br><br><br><br>Իմ կարոտած սրտի համար ո՛չ մի ուրիշ հեքիաթ չկա․<br><br>Նարեկացու, Քուչակի պես լուսապսակ ճակատ չկա․<br><br>Աշխա՛րհ անցի՛ր, Արարատի նման ճերմակ գագաթ չկա․<br><br>Ինչպես անհաս փառքի ճամփա՝ ես իմ Մասիս սա՛րն եմ սիրում։<br><br>",
    
	
	//Պարույր Սևակ
	'Մարդ կա ելել է շալակն աշխարհի, Մարդ կա աշխարհն է շալակած տանում…' : "<h3>Մարդ կա ՝ ելել է շալակն աշխարհի, <br><br> Մարդ կա՝ աշխարհն է շալակած տանում…</h3><br><br><br><br>Մարդ կա ՝ ելել է շալակն աշխարհի,<br><br>Մարդ կա՝ աշխարհն է շալակած տանում…<br><br>Դու, որ սխալվել, սակայն չես ստել,<br><br>Կորցրել ես հաճախ, բայց նորից գտել.<br><br>Դու, որ սայթաքել ու վայր ես ընկել,<br><br>Ընկել ես, սակայն երբեք չես ծնկել,<br><br>Այլ մագլցել ես կատարից կատար,<br><br>Ելել ես անվերջ, բարձրացել ես վեր՝<br><br>Քո ահեղ դարից առնելով թևեր…<br><br>Ելել ես, որ ողջ աշխարհը տեսնես,<br><br>Որ անօրինակ քո դարը տեսնես,<br><br>Բոլոր կերպերով դու նրան զգաս,<br><br>Շահածով խնդաս, կորուստը սգաս…<br><br>Ելել ես իբրև նրա մունետիկ,<br><br>Որ նրա հեռուն զգաս քեզ մոտիկ,<br><br>Որ ճշմարտության ափերը տեսնես,<br><br>Ծպտըված ստի խաբելը տեսնես,<br><br>Որ չվախենաս, որ չվարանես՝<br><br>Անարդարության դեմքը խարանես…<br><br>Ահա թե ինչու դու այսքան տարի,<br><br>Դու, որ հարազատ ծնունդն ես դարի,<br><br>Քայլում ես անդուլ, առաջ ընթանում,<br><br>Քայլում ես այնպես ծանր ու վիթխարի,<br><br>Ասես աշխարհն ես շալակած տանում…<br><br><br><br><br><br>Մարդ կա՝ աշխարհն է շալակած տանում,<br><br>Մարդ կա՝ ելել է շալակն աշխարհի…<br><br><br><br><br><br>Նա, որ ելել է շալակն աշխարհի,<br><br>Աշխարհում երբեք թաց տեղ չի քնում,<br><br>Գիտի, թե ո՛ւմ հետ և ո՛ւր է գնում.<br><br>Ո՛ւմ մեռելին է անարցունք լալիս,<br><br>Ո՛ւմ խոսքի վրա ստից ծիծաղում,<br><br>Ո՛ւմ հետ դինջ նստած նարդի է խաղում,<br><br>Հարկ եղած դեպքում և տանուլ տալիս…<br><br>Վերից է նայում ցածրում կանգնածին,<br><br>Չի նայում երբեք ներքև ընկածին.<br><br>Վերև կանգնածի աղջըկան, որդուն,<br><br>Սիրուհուն անգամ ու քարտուղարին<br><br>Ո՜նց է քսմսվում, ու շողոքորթում…<br><br>Որտեղ մի պատառ չաղ ու յուղալի՝<br><br>Կանգնած է այնտեղ նա երկյուղալի.<br><br>Հեշտ զրպարտում է՝ երբ տեղն է գալիս,<br><br>Նույն հեշտությամբ էլ իր մեղքն է լալիս…<br><br><br><br><br><br>Ամե՜ն ինչից շատ, ամե՜ն ինչից վեր,<br><br>Հարազատ մորից ու որդուց ավել,<br><br>Աշխարհում նա իր աշխարհն է սիրում…<br><br>Սո՛ւտ է: Նա այնտեղ իր շահն է սիրում:<br><br>Ամե՜ն ինչից շատ, ամե՜ն ինչից վեր,<br><br>Նա պատմության մեջ իր դարն է սիրում…<br><br>Սո՛ւտ է: Նա դարի ավարն է սիրում:<br><br>Ամե՜ն ինչից շատ, ամե՜ն ինչից վեր<br><br>Մեր կյանքն է սիրում, մեր նորն է սիրում…<br><br>Սո՛ւտ է: Նա միայն իր փորն է սիրում:<br><br>Ամե՜ն ինչից շատ, ամե՜ն ինչից վեր<br><br>Գաղափարական իր հորն է սիրում…<br><br>Սո՛ւտ է: Ո՛չ հորը, ո՛չ մորն է սիրում,<br><br>Թանկ չէ ո՛չ որդին, և ո՛չ էլ թոռը:<br><br>Ամե՜ն ինչից շատ, ամե՜ն ինչից վեր<br><br>Սիրում է կյանքում նա իր… աթոռը:<br><br>Աթոռն է սիրում<br><br>Ու նրան տիրում.<br><br>Ցանկացած գնով ելնում է նա վեր,<br><br>Փորձում է թռչել նա առանց թևեր,<br><br>Անվերջ սողալով առաջ է գնում,<br><br>Գնում է այսպես և… տարեց-տարի<br><br>Ելնում է այսպես… շալակն աշխարհի:<br><br>Մարդ կա՝ աշխարհն է շալակած տանում,<br><br>Մարդ կա՝ ելել է շալակն աշխարհի…<br><br><br><br>25.X.1955թ. 03.XI.1955թ. Մոսկվա,<br><br>",
	'Հայաստան' : "<h3>Հայաստան</h3><br><br>Իմ քաղցրանո՜ւն, <br><br>Իմ բարձրանո՜ւն,<br><br>Իմ տառապա՛ծ,<br><br>Իմ փառապա՛նծ:<br><br>Հների մեջ՝ դու ալեհեր,<br><br>Նորերի մեջ՝ նոր ու ջահել.<br><br>Դու՝ խաղողի խչմարված վազ,<br><br>Վշտերըդ՝ ջուր, ինքըդ ավազ.<br><br>Դու՝ բարդենի սաղարթաշատ,<br><br>Առուն ի վար փռված փշատ.<br><br>Դու՝ կիսավեր ամրոց ու բերդ,<br><br>Մագաղաթյա մատյանի թերթ.<br><br>Դու՝ Զվարթնոց – ավեր տաճար,<br><br>Դու՝ ջրաղաց խորունկ ձորում,<br><br>Դու՝ հորովել անուշ ծորուն,<br><br>Փայլ գութանի արծաթ խոփի.<br><br>Դու՝ նե՛տ, նիզա՛կ, մկո՛ւնդ կոպիտ,<br><br>Դու՝ հայրենի ծխանի ծուխ,<br><br>Դու՝ անգի՛ր վեպ, դու՝ Սասնա ծո՜ւռ…<br><br><br><br>Իմ փառապա՛նծ<br><br>Իմ տառապա՛ծ,<br><br>Իմ բարձրանո՜ւն,<br><br>Իմ քաղցրանո՜ւն:<br><br>Դու՝ մրգերի շտեմարան,<br><br>Ոսկեվազյան գինու մառան.<br><br>Դու՝ թավշե դեղձ, դու՝ փրփուր հաց,<br><br>Արտաշատյան խաղող սևաչ.<br><br>Դու՝ Սևանի վառվող կոհակ,<br><br>Երևանի սյուն ու խոյակ.<br><br>Դու՝ հանգրվան, կանչող փարոս,<br><br>Դու՝ հայկական գերբ ու դրոշ.<br><br>Խոսուն վկա կոտորածի<br><br>Ու վճիտ աչք ցամքած լացի,<br><br>Արդարության ահեղ ատյան,<br><br>Սրի պատյան,<br><br>Սիրո մատյան –<br><br>Միշտ հի՛ն ու նո՛ր իմ Հայաստան:<br><br><br><br>11.XI.1950թ. Երևան<br><br>",
    
	
	//Համո Սահյան
	'Հայաստան ասելիս' : "<h3>Հայաստան ասելիս</h3><br><br>Հայաստան ասելիս այտերս այրվում են,<br><br>Հայաստան ասելիս ծնկներս ծալվում են,<br><br>Չգիտեմ ինչու է այդպես:<br><br>Հայաստան ասելիս շրթունքս ճաքում է,<br><br>Հայաստան ասելիս հասակս ծաղկում է,<br><br>Չգիտեմ ինչու է այդպես:<br><br>Հայաստան ասելիս աչքերս լցվում են,<br><br>Հայաստան ասելիս թևերս բացվում են,<br><br>Չգիտեմ ինչու է այդպես:<br><br>Հայաստան ասելիս աշխարհը իմ տունն է,<br><br>Հայաստան ասելիս էլ մահը ո՞ւմ շունն է…<br><br>Կմնամ, կլինեմ այսպես:<br><br>",
	
	
	//Հովհաննես Թումանյան
	'Հայոց լեռներում' : "<h3>Հայոց լեռներում</h3><br><br>Մեր ճամփեն խավար, մեր ճամփեն գիշեր,<br><br>Ու մենք անհատնում<br><br>էն անլույս մըթնում<br><br>Երկա՜ր դարերով գընում ենք դեպ վեր<br><br>Հայոց լեռներում,<br><br>Դըժար լեռներում։<br><br><br><br>Տանում ենք հընուց մեր գանձերն անգին,<br><br>Մեր գանձերը ծով,<br><br>Ինչ որ դարերով<br><br>Երկնել է, ծընել մեր խորունկ հոգին<br><br>Հայոց լեռներում,<br><br>Բարձըր լեռներում։<br><br><br><br>Բայց քանի անգամ շեկ անապատի<br><br>Օրդուները սև<br><br>Իրարու ետև<br><br>Եկա՜ն զարկեցին մեր քարվանն ազնիվ<br><br>Հայոց լեռներում,<br><br>Արնոտ լեռներում։<br><br><br><br>Ու մեր քարվանը շըփոթ, սոսկահար,<br><br>Թալանված, ջարդված<br><br>Ու հատված-հատված<br><br>Տանում է իրեն վերքերն անհամար<br><br>Հայոց լեռներում,<br><br>Սուգի լեռներում։<br><br><br><br>Ու մեր աչքերը նայում են կարոտ՝<br><br>Հեռու աստղերին,<br><br>Երկընքի ծերին,<br><br>Թե ե՞րբ կըբացվի պայծառ առավոտ՝<br><br>Հայոց լեռներում,<br><br>Կանաչ լեռներում։<br><br>"

	};

function content_prt(poem_name_){
	document.getElementById("cont").innerHTML = dict_poets[poem_name_];
}


function creat_el(poem_name) {
  var btn = document.createElement("LI");
  btn.setAttribute('onclick', 'content_prt("' + poem_name + '")');
  btn.style.margin = "1px";
  btn.style.paddingLeft = "1px";
  btn.innerHTML = poem_name;
  document.getElementById("poems").appendChild(btn);
 

  }

function myFunction(ban_anun, for_list) {
    document.getElementById("cont").innerHTML = " ";	
    document.getElementById("poems").innerHTML = " ";
	document.getElementById("name_poet").innerHTML = ban_anun;
	for(poem of dict[for_list]){      
		  creat_el(poem);
	}
	}

function sear(){
	var value = document.getElementById("search").value;
	try {
		content_prt(value);
		}
	catch {
		document.getElementById("search").innerHTML = "Արդյունք չկա";
		}
	
}


/*function searc(){
	var val = document.getElementById("search").value;
	for(elem of dict_poets){
		if(elem.test(val)){
			document.write("sssssssss");
		}else{document.write("aaaaaaaa");}
		
	}
}*/











